sterentev/atdf-device-asm-include/inc/AT90PWM3.inc
; ----------	Register PSOC0 bits		------------------------
.equ	PSYNC0_MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC00		= 4		;          PSYNC0 BIT0 position
.equ	POEN0B		= 2		; 0x04 - PSCOUT01 Output Enable
.equ	POEN0A		= 0		; 0x01 - PSCOUT00 Output Enable
; ::::  PSYNC0	:::: bitfield values
;			0x00		; Send signal on leading edge of PSCOUTn0
;			0x10		; Send signal on trailing edge of PSCOUTn0
;			0x20		; Send signal on leading edge of PSCOUTn1
;			0x30		; Send signal on trailing edge of PSCOUTn1

; ----------	Register PIM0 bits		------------------------
.equ	PSEIE0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt Enable
.equ	PEVE0B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE0A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE0		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR0 bits		------------------------
.equ	PSEI0		= 5		; 0x20 - PSC 0 Synchro Error Interrupt
.equ	PEV0B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV0A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN0_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN00		= 1		;          PRN0 BIT0 position
.equ	PEOP0		= 0		; 0x01 - End of PSC0 Interrupt
; ::::  PRN0	:::: bitfield values
;			0x00		; 1
;			0x02		; 2
;			0x04		; 3
;			0x06		; 4

; ----------	Register PFRC1B bits		------------------------
.equ	PCAE1B		= 7		; 0x80 - PSC 1 Capture Enable Input Part B
.equ	PISEL1B		= 6		; 0x40 - PSC 1 Input Select for Part B
.equ	PELEV1B		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part B
.equ	PFLTE1B		= 4		; 0x10 - PSC 1 Filter Enable on Input Part B
.equ	PRFM1B_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM1B0		= 0		;          PRFM1B BIT0 position
; ::::  PRFM1B	:::: bitfield values
;			0x00		; No action, PSC Input is ignored
;			0x01		; Stop signal, Jump to Opposite Dead-Time and Wait
;			0x02		; Stop signal, Execute Opposite Dead-Time and Wait
;			0x03		; Stop signal, Execute Opposite while Fault active
;			0x04		; Deactivate outputs without changing timing.
;			0x05		; Stop signal and Insert Dead-Time
;			0x06		; Stop signal, Jump to Opposite Dead-Time and Wait.
;			0x07		; Halt PSC and Wait for Software Action
;			0x08		; Edge Retrigger PSC
;			0x09		; Fixed Frequency Edge Retrigger PSC
;			0x0A		; Reserved (do not use)
;			0x0B		; Reserved (do not use)
;			0x0C		; Reserved (do not use)
;			0x0D		; Reserved (do not use)
;			0x0E		; Fixed Frequency Edge Retrigger PSC and Deactivate Output
;			0x0F		; Reserved (do not use)

; ----------	Register PFRC1A bits		------------------------
.equ	PCAE1A		= 7		; 0x80 - PSC 1 Capture Enable Input Part A
.equ	PISEL1A		= 6		; 0x40 - PSC 1 Input Select for Part A
.equ	PELEV1A		= 5		; 0x20 - PSC 1 Edge Level Selector on Input Part A
.equ	PFLTE1A		= 4		; 0x10 - PSC 1 Filter Enable on Input Part A
.equ	PRFM1A_MASK	= 0x0F		;      - PSC 1 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM1A0		= 0		;          PRFM1A BIT0 position
; ::::  PRFM1A	:::: bitfield values
;			0x00		; No action, PSC Input is ignored
;			0x01		; Stop signal, Jump to Opposite Dead-Time and Wait
;			0x02		; Stop signal, Execute Opposite Dead-Time and Wait
;			0x03		; Stop signal, Execute Opposite while Fault active
;			0x04		; Deactivate outputs without changing timing.
;			0x05		; Stop signal and Insert Dead-Time
;			0x06		; Stop signal, Jump to Opposite Dead-Time and Wait.
;			0x07		; Halt PSC and Wait for Software Action
;			0x08		; Edge Retrigger PSC
;			0x09		; Fixed Frequency Edge Retrigger PSC
;			0x0A		; Reserved (do not use)
;			0x0B		; Reserved (do not use)
;			0x0C		; Reserved (do not use)
;			0x0D		; Reserved (do not use)
;			0x0E		; Fixed Frequency Edge Retrigger PSC and Deactivate Output
;			0x0F		; Reserved (do not use)

; ----------	Register PCTL1 bits		------------------------
.equ	PPRE1_MASK	= 0xC0		;      - PSC 1 Prescaler Selects (2 bits)
.equ	PPRE10		= 6		;          PPRE1 BIT0 position
.equ	PBFM1		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC1B		= 4		; 0x10 - PSC 1 Asynchronous Output Control B
.equ	PAOC1A		= 3		; 0x08 - PSC 1 Asynchronous Output Control A
.equ	PARUN1		= 2		; 0x04 - PSC1 Auto Run
.equ	PCCYC1		= 1		; 0x02 - PSC1 Complete Cycle
.equ	PRUN1		= 0		; 0x01 - PSC 1 Run
; ::::  PPRE1	:::: bitfield values
;			0x00		; No divider on PSC input clock
;			0x40		; Divide the PSC input clock by 4
;			0x80		; Divide the PSC input clock by 16
;			0xC0		; Divide the PSC input clock by 64

; ----------	Register PCNF1 bits		------------------------
.equ	PFIFTY1		= 7		; 0x80 - PSC 1 Fifty
.equ	PALOCK1		= 6		; 0x40 - PSC 1 Autolock
.equ	PLOCK1		= 5		; 0x20 - PSC 1 Lock
.equ	PMODE1_MASK	= 0x18		;      - PSC 1 Mode (2 bits)
.equ	PMODE10		= 3		;          PMODE1 BIT0 position
.equ	POP1		= 2		; 0x04 - PSC 1 Output Polarity
.equ	PCLKSEL1	= 1		; 0x02 - PSC 1 Input Clock Select
; ::::  PMODE1	:::: bitfield values
;			0x00		; One Ramp Mode
;			0x08		; Two Ramp Mode
;			0x10		; Four Ramp Mode
;			0x18		; Center Aligned Mode

; ----------	Register PSOC1 bits		------------------------
.equ	PSYNC1__MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC1_0	= 4		;          PSYNC1_ BIT0 position
.equ	POEN1B		= 2		; 0x04 - PSCOUT11 Output Enable
.equ	POEN1A		= 0		; 0x01 - PSCOUT10 Output Enable
; ::::  PSYNC1_	:::: bitfield values
;			0x00		; Send signal on leading edge of PSCOUTn0
;			0x10		; Send signal on trailing edge of PSCOUTn0
;			0x20		; Send signal on leading edge of PSCOUTn1
;			0x30		; Send signal on trailing edge of PSCOUTn1

; ----------	Register PIM1 bits		------------------------
.equ	PSEIE1		= 5		; 0x20 - PSC 1 Synchro Error Interrupt Enable
.equ	PEVE1B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE1A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE1		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR1 bits		------------------------
.equ	PSEI1		= 5		; 0x20 - PSC 1 Synchro Error Interrupt
.equ	PEV1B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV1A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN1_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN10		= 1		;          PRN1 BIT0 position
.equ	PEOP1		= 0		; 0x01 - End of PSC1 Interrupt
; ::::  PRN1	:::: bitfield values
;			0x00		; 1
;			0x02		; 2
;			0x04		; 3
;			0x06		; 4

; ----------	Register PICR2 bits		------------------------
.equ	PICR2_MASK	= 0x0FFF	;      - PSC 2 Input Capture Bytes (12 bits)
.equ	PICR20		= 0		;          PICR2 BIT0 position

