sterentev/atdf-device-asm-include/inc/AT90PWM3.inc
; ----------	Register PFRC2B bits		------------------------
.equ	PCAE2B		= 7		; 0x80 - PSC 2 Capture Enable Input Part B
.equ	PISEL2B		= 6		; 0x40 - PSC 2 Input Select for Part B
.equ	PELEV2B		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part B
.equ	PFLTE2B		= 4		; 0x10 - PSC 2 Filter Enable on Input Part B
.equ	PRFM2B_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part B (4 bits)
.equ	PRFM2B0		= 0		;          PRFM2B BIT0 position
; ::::  PRFM2B	:::: bitfield values
;			0x00		; No action, PSC Input is ignored
;			0x01		; Stop signal, Jump to Opposite Dead-Time and Wait
;			0x02		; Stop signal, Execute Opposite Dead-Time and Wait
;			0x03		; Stop signal, Execute Opposite while Fault active
;			0x04		; Deactivate outputs without changing timing.
;			0x05		; Stop signal and Insert Dead-Time
;			0x06		; Stop signal, Jump to Opposite Dead-Time and Wait.
;			0x07		; Halt PSC and Wait for Software Action
;			0x08		; Edge Retrigger PSC
;			0x09		; Fixed Frequency Edge Retrigger PSC
;			0x0A		; Reserved (do not use)
;			0x0B		; Reserved (do not use)
;			0x0C		; Reserved (do not use)
;			0x0D		; Reserved (do not use)
;			0x0E		; Fixed Frequency Edge Retrigger PSC and Deactivate Output
;			0x0F		; Reserved (do not use)

; ----------	Register PFRC2A bits		------------------------
.equ	PCAE2A		= 7		; 0x80 - PSC 2 Capture Enable Input Part A
.equ	PISEL2A		= 6		; 0x40 - PSC 2 Input Select for Part A
.equ	PELEV2A		= 5		; 0x20 - PSC 2 Edge Level Selector on Input Part A
.equ	PFLTE2A		= 4		; 0x10 - PSC 2 Filter Enable on Input Part A
.equ	PRFM2A_MASK	= 0x0F		;      - PSC 2 Retrigger and Fault Mode for Part A (4 bits)
.equ	PRFM2A0		= 0		;          PRFM2A BIT0 position
; ::::  PRFM2A	:::: bitfield values
;			0x00		; No action, PSC Input is ignored
;			0x01		; Stop signal, Jump to Opposite Dead-Time and Wait
;			0x02		; Stop signal, Execute Opposite Dead-Time and Wait
;			0x03		; Stop signal, Execute Opposite while Fault active
;			0x04		; Deactivate outputs without changing timing.
;			0x05		; Stop signal and Insert Dead-Time
;			0x06		; Stop signal, Jump to Opposite Dead-Time and Wait.
;			0x07		; Halt PSC and Wait for Software Action
;			0x08		; Edge Retrigger PSC
;			0x09		; Fixed Frequency Edge Retrigger PSC
;			0x0A		; Reserved (do not use)
;			0x0B		; Reserved (do not use)
;			0x0C		; Reserved (do not use)
;			0x0D		; Reserved (do not use)
;			0x0E		; Fixed Frequency Edge Retrigger PSC and Deactivate Output
;			0x0F		; Reserved (do not use)

; ----------	Register PCTL2 bits		------------------------
.equ	PPRE2_MASK	= 0xC0		;      - PSC 2 Prescaler Selects (2 bits)
.equ	PPRE20		= 6		;          PPRE2 BIT0 position
.equ	PBFM2		= 5		; 0x20 - Balance Flank Width Modulation
.equ	PAOC2B		= 4		; 0x10 - PSC 2 Asynchronous Output Control B
.equ	PAOC2A		= 3		; 0x08 - PSC 2 Asynchronous Output Control A
.equ	PARUN2		= 2		; 0x04 - PSC2 Auto Run
.equ	PCCYC2		= 1		; 0x02 - PSC2 Complete Cycle
.equ	PRUN2		= 0		; 0x01 - PSC 2 Run
; ::::  PPRE2	:::: bitfield values
;			0x00		; No divider on PSC input clock
;			0x40		; Divide the PSC input clock by 4
;			0x80		; Divide the PSC input clock by 16
;			0xC0		; Divide the PSC input clock by 64

; ----------	Register PCNF2 bits		------------------------
.equ	PFIFTY2		= 7		; 0x80 - PSC 2 Fifty
.equ	PALOCK2		= 6		; 0x40 - PSC 2 Autolock
.equ	PLOCK2		= 5		; 0x20 - PSC 2 Lock
.equ	PMODE2_MASK	= 0x18		;      - PSC 2 Mode (2 bits)
.equ	PMODE20		= 3		;          PMODE2 BIT0 position
.equ	POP2		= 2		; 0x04 - PSC 2 Output Polarity
.equ	PCLKSEL2	= 1		; 0x02 - PSC 2 Input Clock Select
.equ	POME2		= 0		; 0x01 - PSC 2 Output Matrix Enable
; ::::  PMODE2	:::: bitfield values
;			0x00		; One Ramp Mode
;			0x08		; Two Ramp Mode
;			0x10		; Four Ramp Mode
;			0x18		; Center Aligned Mode

; ----------	Register OCR2RB bits		------------------------
.equ	OCR2RB_MASK	= 0xFFFF	;      - Output Compare RB (16 bits)
.equ	OCR2RB0		= 0		;          OCR2RB BIT0 position

; ----------	Register OCR2SB bits		------------------------
.equ	OCR2SB_MASK	= 0x0FFF	;      - Output Compare SB (12 bits)
.equ	OCR2SB0		= 0		;          OCR2SB BIT0 position

; ----------	Register OCR2RA bits		------------------------
.equ	OCR2RA_MASK	= 0x0FFF	;      - Output Compare RA (12 bits)
.equ	OCR2RA0		= 0		;          OCR2RA BIT0 position

; ----------	Register OCR2SA bits		------------------------
.equ	OCR2SA_MASK	= 0x0FFF	;      - Output Compare SA (12 bits)
.equ	OCR2SA0		= 0		;          OCR2SA BIT0 position

; ----------	Register POM2 bits		------------------------
.equ	POMV2B_MASK	= 0xF0		;      - Output Matrix Output B Ramps (4 bits)
.equ	POMV2B0		= 4		;          POMV2B BIT0 position
.equ	POMV2A_MASK	= 0x0F		;      - Output Matrix Output A Ramps (4 bits)
.equ	POMV2A0		= 0		;          POMV2A BIT0 position

; ----------	Register PSOC2 bits		------------------------
.equ	POS2_MASK	= 0xC0		;      - PSC 2 Output 23 Select (2 bits)
.equ	POS20		= 6		;          POS2 BIT0 position
.equ	PSYNC2__MASK	= 0x30		;      - Synchronization Out for ADC Selection (2 bits)
.equ	PSYNC2_0	= 4		;          PSYNC2_ BIT0 position
.equ	POEN2D		= 3		; 0x08 - PSCOUT23 Output Enable
.equ	POEN2B		= 2		; 0x04 - PSCOUT21 Output Enable
.equ	POEN2C		= 1		; 0x02 - PSCOUT22 Output Enable
.equ	POEN2A		= 0		; 0x01 - PSCOUT20 Output Enable

; ----------	Register PIM2 bits		------------------------
.equ	PSEIE2		= 5		; 0x20 - PSC 2 Synchro Error Interrupt Enable
.equ	PEVE2B		= 4		; 0x10 - External Event B Interrupt Enable
.equ	PEVE2A		= 3		; 0x08 - External Event A Interrupt Enable
.equ	PEOPE2		= 0		; 0x01 - End of Cycle Interrupt Enable

; ----------	Register PIFR2 bits		------------------------
.equ	PSEI2		= 5		; 0x20 - PSC 2 Synchro Error Interrupt
.equ	PEV2B		= 4		; 0x10 - External Event B Interrupt
.equ	PEV2A		= 3		; 0x08 - External Event A Interrupt
.equ	PRN2_MASK	= 0x06		;      - Ramp Number (2 bits)
.equ	PRN20		= 1		;          PRN2 BIT0 position
.equ	PEOP2		= 0		; 0x01 - End of PSC2 Interrupt
; ::::  PRN2	:::: bitfield values
;			0x00		; 1
;			0x02		; 2
;			0x04		; 3
;			0x06		; 4




